In [2]:
import numpy as np

import pandas as pd
from pandas import Series,DataFrame

# Combining DataFrames with Series:

In [3]:
ser1 = Series([2,np.nan,4,np.nan,6,np.nan],index=['Q','R','S','T','U','V'])

ser1

Q    2.0
R    NaN
S    4.0
T    NaN
U    6.0
V    NaN
dtype: float64

In [4]:
ser2 = Series(np.arange(len(ser1)),dtype=np.float64,index=['Q','R','S','T','U','V'])

ser2

Q    0.0
R    1.0
S    2.0
T    3.0
U    4.0
V    5.0
dtype: float64

In [5]:
# Syntax here creates a series where if a value from ser1 is NULL, then select that same key value from ser2, as
# long as ser2 is not NULL, if so then place the ser1 value. all while using the ser1 index
Series(np.where(pd.isnull(ser1),ser2,ser1),index=ser1.index)

Q    2.0
R    1.0
S    4.0
T    3.0
U    6.0
V    5.0
dtype: float64

In [6]:
# here's the shortcut
ser1.combine_first(ser2)

Q    2.0
R    1.0
S    4.0
T    3.0
U    6.0
V    5.0
dtype: float64

# Combining DataFrames with DataFrames:

In [7]:
nan = np.nan
dframe_odds = DataFrame({'X':[1.,nan,3.,nan],'Y':[nan,5.,nan,7.],'Z':[nan,9.,nan,11]})

In [8]:
dframe_evens = DataFrame({'X':[2.,4.,nan,6.,8.],'Y':[nan,10.,12.,14.,16.]})

In [9]:
dframe_odds

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>X</th>
      <th>Y</th>
      <th>Z</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>1.0</td>
      <td>NaN</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>1</th>
      <td>NaN</td>
      <td>5.0</td>
      <td>9.0</td>
    </tr>
    <tr>
      <th>2</th>
      <td>3.0</td>
      <td>NaN</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>3</th>
      <td>NaN</td>
      <td>7.0</td>
      <td>11.0</td>
    </tr>
  </tbody>
</table>
</div>

In [10]:
dframe_evens

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>X</th>
      <th>Y</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>2.0</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>1</th>
      <td>4.0</td>
      <td>10.0</td>
    </tr>
    <tr>
      <th>2</th>
      <td>NaN</td>
      <td>12.0</td>
    </tr>
    <tr>
      <th>3</th>
      <td>6.0</td>
      <td>14.0</td>
    </tr>
    <tr>
      <th>4</th>
      <td>8.0</td>
      <td>16.0</td>
    </tr>
  </tbody>
</table>
</div>

In [11]:
dframe_odds.combine_first(dframe_evens)

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>X</th>
      <th>Y</th>
      <th>Z</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>1.0</td>
      <td>NaN</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>1</th>
      <td>4.0</td>
      <td>5.0</td>
      <td>9.0</td>
    </tr>
    <tr>
      <th>2</th>
      <td>3.0</td>
      <td>12.0</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>3</th>
      <td>6.0</td>
      <td>7.0</td>
      <td>11.0</td>
    </tr>
    <tr>
      <th>4</th>
      <td>8.0</td>
      <td>16.0</td>
      <td>NaN</td>
    </tr>
  </tbody>
</table>
</div>